In [2]:
import pandas as pd

## 예제 1-10 내부 원소 처리 기준

In [1]:
import numpy as np

In [3]:
df_1 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('ABC'))

In [4]:
df_1

   A  B  C
0  6  6  1
1  5  5  1
2  7  9  3

In [5]:
df_2 = pd.DataFrame(np.random.randint(1,10,(3,3)),columns=list('CAB'))

In [6]:
df_2

   C  A  B
0  8  6  9
1  1  8  9
2  6  2  7

In [7]:
np.log(df_2)

          C         A         B
0  2.079442  1.791759  2.197225
1  0.000000  2.079442  2.197225
2  1.791759  0.693147  1.945910

In [8]:
df_1 + df_2

    A   B  C
0  12  15  9
1  13  14  2
2   9  16  9

In [9]:
df_3 = pd.DataFrame(np.random.randint(1,10,(3,2)),columns=list('CB'))

In [10]:
df_3

   C  B
0  3  5
1  1  8
2  5  8

In [11]:
df_1 + df_3

    A   B  C
0 NaN  11  4
1 NaN  13  2
2 NaN  17  8

## 예제 1-11 한글 인코딩 알아보기

In [2]:
!pip install chardet

Requirement already satisfied: chardet in c:\users\06411\appdata\local\continuum\anaconda3\lib\site-packages (3.0.4)

In [3]:
import chardet

In [4]:
def find_encoding(fname):
    r_file = open(fname, 'rb').read()
    result = chardet.detect(r_file)
    charenc = result['encoding']
    return charenc

In [5]:
my_encoding1 = find_encoding('../data/weight_loss.csv')
df_1 = pd.read_csv('../data/weight_loss.csv', encoding=my_encoding1)

In [6]:
my_encoding1

'EUC-KR'

In [12]:
try :
    pd.read_csv('../data/weight_loss.csv', encoding="utf-8")
    
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc0 in position 0: invalid start byte

In [7]:
df_1.head()

   이름   월   주  몸무게
0  지원  1월  1주  291
1  찬주  1월  1주  197
2  지원  1월  2주  288
3  찬주  1월  2주  189
4  지원  1월  3주  283

In [8]:
my_encoding2 = find_encoding('../data/korea_movie_list.csv')
df_2 = pd.read_csv('../data/korea_movie_list.csv', encoding=my_encoding2)

In [9]:
my_encoding2

'CP949'

In [13]:
try :
    pd.read_csv('../data/korea_movie_list.csv', encoding="utf-8")
    
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 0: invalid continuation byte

In [11]:
df_2.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

In [14]:
df_3 = pd.read_csv('../data/korea_movie_list.csv', engine='python')

In [15]:
df_3.head(2)

,movie_code,title,title_Eng,show_time,produce_year,open_date,produce_state,type,nation,genre,director,actor,show_type,watch_grade
0,20185801,할로우 차일드,The Hollow Child,88.0,2017,20180802,개봉예정,장편,캐나다,공포(호러)/판타지,제레미 루터,NaN,NaN,15세이상관람가
1,20187649,죽음의 리무진,Glass Coffin,75.0,2016,20180816,개봉예정,장편,스페인,스릴러/공포(호러),하리츠 쥬빌라가,파울라 본템피,NaN,NaN

In [17]:
try :
    pd.read_csv('../data/korea_movie_list.csv', engine='c')
except Exception as e :
    print(e)

'utf-8' codec can't decode byte 0xc7 in position 0: invalid continuation byte

In [18]:
url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/attention.csv'

In [20]:
df_att = pd.read_csv(url,error_bad_lines=False)

In [21]:
df_att.head()

   Unnamed: 0  subject attention  solutions  score
0           0        1   divided          1    2.0
1           1        2   divided          1    3.0
2           2        3   divided          1    3.0
3           3        4   divided          1    5.0
4           4        5   divided          1    4.0

In [22]:
df_att.drop('Unnamed: 0',axis=1).head()

   subject attention  solutions  score
0        1   divided          1    2.0
1        2   divided          1    3.0
2        3   divided          1    3.0
3        4   divided          1    5.0
4        5   divided          1    4.0